In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
#Q1 drop_duplicates removes all duplicates in the mentioned criteria

In [14]:
nba=pd.read_csv(r"C:\Users\Preeti\OneDrive\Desktop\Preeti\Christ\Excel files (python)\nba.csv")
nba

,Name,Team,Position,Height,Weight,College,Salary
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.0
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.0
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.0
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.0
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.0
...,...,...,...,...,...,...,...
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.0
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.0
589,Tristan Vukcevic,Washington Wizards,F,6-10,220.0,Real Madrid,NaN
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.0
591,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [15]:
nba["Name"].fillna("Exclude",inplace=True)

C:\Users\Preeti\AppData\Local\Temp\ipykernel_24788\341173198.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  nba["Name"].fillna("Exclude",inplace=True)

In [16]:
nba

,Name,Team,Position,Height,Weight,College,Salary
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.0
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.0
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.0
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.0
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.0
...,...,...,...,...,...,...,...
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.0
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.0
589,Tristan Vukcevic,Washington Wizards,F,6-10,220.0,Real Madrid,NaN
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.0
591,Exclude,NaN,NaN,NaN,NaN,NaN,NaN

In [17]:
nba.fillna("Unknown",inplace=True)

C:\Users\Preeti\AppData\Local\Temp\ipykernel_24788\2091351466.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Unknown' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  nba.fillna("Unknown",inplace=True)

In [18]:
nba

,Name,Team,Position,Height,Weight,College,Salary
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.0
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.0
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.0
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.0
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.0
...,...,...,...,...,...,...,...
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.0
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.0
589,Tristan Vukcevic,Washington Wizards,F,6-10,220.0,Real Madrid,Unknown
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.0
591,Exclude,Unknown,Unknown,Unknown,Unknown,Unknown,Unknown

In [26]:
nba=pd.read_csv(r"C:\Users\Preeti\OneDrive\Desktop\Preeti\Christ\Excel files (python)\nba.csv")
nba

,Name,Team,Position,Height,Weight,College,Salary
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.0
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.0
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.0
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.0
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.0
...,...,...,...,...,...,...,...
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.0
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.0
589,Tristan Vukcevic,Washington Wizards,F,6-10,220.0,Real Madrid,NaN
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.0
591,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [27]:
nba.dropna()

,Name,Team,Position,Height,Weight,College,Salary
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.0
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.0
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.0
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.0
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.0
...,...,...,...,...,...,...,...
585,Eugene Omoruyi,Washington Wizards,F,6-6,235.0,Oregon,559782.0
586,Jordan Poole,Washington Wizards,G,6-4,194.0,Michigan,27955357.0
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.0
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.0
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.0

In [28]:
nba["New_salary"]=nba["Salary"]*1.05
nba

,Name,Team,Position,Height,Weight,College,Salary,New_salary
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.0,4784832.15
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.0,19635000.00
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.0,4298956.20
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.0,21646800.00
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.0,2710598.10
...,...,...,...,...,...,...,...,...
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.0,1805857.20
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.0,10762500.00
589,Tristan Vukcevic,Washington Wizards,F,6-10,220.0,Real Madrid,NaN,NaN
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.0,8604878.10
591,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [29]:
fortune=pd.read_csv(r"C:\Users\Preeti\OneDrive\Desktop\Preeti\Christ\Excel files (python)\fortune1000.csv")
fortune

,Rank,Company,Sector,Industry,Revenue,Profits,Employees
0,1,Walmart,Retailing,General Merchandisers,482130,14694,2300000
1,2,Exxon Mobil,Energy,Petroleum Refining,246204,16150,75600
2,3,Apple,Technology,"Computers, Office Equipment",233715,53394,110000
3,4,Berkshire Hathaway,Financials,Insurance: Property and Casualty (Stock),210821,24083,331000
4,5,McKesson,Health Care,Wholesalers: Health Care,181241,1476,70400
...,...,...,...,...,...,...,...
995,996,New York Community Bancorp,Financials,Commercial Banks,1902,-47,3448
996,997,Portland General Electric,Energy,Utilities: Gas and Electric,1898,172,2646
997,997,Portland General Electric,Energy,Utilities: Gas and Electric,1898,172,2646
998,999,Wendy’s,"Hotels, Resturants & Leisure",Food Services,1896,161,21200
999,1000,Briggs & Stratton,Industrials,Industrial Machinery,1895,46,5480

In [30]:
df=fortune

In [31]:
df

,Rank,Company,Sector,Industry,Revenue,Profits,Employees
0,1,Walmart,Retailing,General Merchandisers,482130,14694,2300000
1,2,Exxon Mobil,Energy,Petroleum Refining,246204,16150,75600
2,3,Apple,Technology,"Computers, Office Equipment",233715,53394,110000
3,4,Berkshire Hathaway,Financials,Insurance: Property and Casualty (Stock),210821,24083,331000
4,5,McKesson,Health Care,Wholesalers: Health Care,181241,1476,70400
...,...,...,...,...,...,...,...
995,996,New York Community Bancorp,Financials,Commercial Banks,1902,-47,3448
996,997,Portland General Electric,Energy,Utilities: Gas and Electric,1898,172,2646
997,997,Portland General Electric,Energy,Utilities: Gas and Electric,1898,172,2646
998,999,Wendy’s,"Hotels, Resturants & Leisure",Food Services,1896,161,21200
999,1000,Briggs & Stratton,Industrials,Industrial Machinery,1895,46,5480

In [32]:
fortune

,Rank,Company,Sector,Industry,Revenue,Profits,Employees
0,1,Walmart,Retailing,General Merchandisers,482130,14694,2300000
1,2,Exxon Mobil,Energy,Petroleum Refining,246204,16150,75600
2,3,Apple,Technology,"Computers, Office Equipment",233715,53394,110000
3,4,Berkshire Hathaway,Financials,Insurance: Property and Casualty (Stock),210821,24083,331000
4,5,McKesson,Health Care,Wholesalers: Health Care,181241,1476,70400
...,...,...,...,...,...,...,...
995,996,New York Community Bancorp,Financials,Commercial Banks,1902,-47,3448
996,997,Portland General Electric,Energy,Utilities: Gas and Electric,1898,172,2646
997,997,Portland General Electric,Energy,Utilities: Gas and Electric,1898,172,2646
998,999,Wendy’s,"Hotels, Resturants & Leisure",Food Services,1896,161,21200
999,1000,Briggs & Stratton,Industrials,Industrial Machinery,1895,46,5480

In [33]:
fortune[(fortune["Profits"]>=30 )&(fortune["Profits"]<=55)]

,Rank,Company,Sector,Industry,Revenue,Profits,Employees
275,276,Global Partners,Wholesalers,Wholesalers: Diversified,10315,44,1890
316,317,Core-Mark Holding,Wholesalers,Wholesalers: Food and Grocery,8858,52,6655
426,427,Barnes & Noble,Retailing,Specialty Retailers: Other,6070,37,37000
462,463,Lansing Trade Group,Wholesalers,Wholesalers: Diversified,5565,35,500
466,467,Kelly Services,Business Services,Temporary Help,5518,54,8100
515,516,Tutor Perini,Engineering & Construction,"Engineering, Construction",4921,45,10626
536,537,Magellan Health,Health Care,Health Care: Insurance and Managed Care,4597,31,6900
568,569,Alon USA Energy,Energy,Petroleum Refining,4260,53,2860
594,595,Smart & Final Stores,Food and Drug Stores,Food and Drug Stores,3971,38,6939
605,606,Dynegy,Energy,Energy,3870,50,2591
626,627,Boise Cascade,Wholesalers,Wholesalers: Diversified,3633,52,5830
643,644,Abercrombie & Fitch,Retailing,Specialty Retailers: Apparel,3519,36,28500
676,677,Clean Harbors,Business Services,Waste Management,3275,44,12900
686,687,Aleris,Materials,Metals,3206,49,5200
748,749,Triple-S Management,Health Care,Health Care: Insurance and Managed Care,2903,52,3405
799,800,ArcBest,Transportation,"Trucking, Truck Leasing",2667,45,13000
802,803,TriNet Group,Business Services,Diversified Outsourcing Services,2659,32,2500
812,813,Valmont Industries,Industrials,Construction and Farm Machinery,2619,40,10697
815,816,Insperity,Business Services,Diversified Outsourcing Services,2604,39,2400
819,820,Apollo Education Group,Business Services,Education,2591,30,23400
824,825,PC Connection,Retailing,Specialty Retailers: Other,2574,47,2155
879,880,Nationstar Mortgage Holdings,Financials,Diversified Financials,2339,39,6740
891,892,Tetra Tech,Engineering & Construction,"Engineering, Construction",2299,39,13000
894,895,Pinnacle Entertainment,"Hotels, Resturants & Leisure","Hotels, Casinos, Resorts",2292,49,14726
917,918,Boyd Gaming,"Hotels, Resturants & Leisure","Hotels, Casinos, Resorts",2199,47,18243
921,922,Outerwall,Retailing,Specialty Retailers: Other,2195,44,2670
959,960,PharMerica,Health Care,Health Care: Pharmacy and Other Services,2029,35,5200
961,962,Ferrellgas Partners,Energy,Energy,2024,30,4028
966,967,Griffon,Household Products,"Home Equipment, Furnishings",2016,34,6000
973,974,Roadrunner Transportation Systems,Transportation,Transportation and Logistics,1995,48,4502
976,977,Hill-Rom Holdings,Health Care,Medical Products and Equipment,1988,48,10000
984,985,Primoris Services,Engineering & Construction,"Engineering, Construction",1929,37,7011
999,1000,Briggs & Stratton,Industrials,Industrial Machinery,1895,46,5480

In [35]:
df[(df["Employees"]>=500) & (df["Employees"]<=1000)]

,Rank,Company,Sector,Industry,Revenue,Profits,Employees
462,463,Lansing Trade Group,Wholesalers,Wholesalers: Diversified,5565,35,500
652,653,Sprague Resources,Wholesalers,Wholesalers: Diversified,3482,78,590
741,742,Green Plains,Energy,Energy,2966,7,995
783,784,New Jersey Resources,Energy,Energy,2734,181,991
845,846,Boston Properties,Financials,Real estate,2491,583,765
924,925,Knights of Columbus,Financials,"Insurance: Life, Health (Mutual)",2180,68,929
952,953,Par Pacific Holdings,Energy,Petroleum Refining,2066,-40,744
965,966,QEP Resources,Energy,"Mining, Crude-Oil Production",2019,-149,693
982,983,Adams Resources & Energy,Energy,Petroleum Refining,1944,-1,809
994,995,EP Energy,Energy,"Mining, Crude-Oil Production",1908,-3748,665

In [39]:
dt= pd.DataFrame(fortune)

In [40]:
dt

,Rank,Company,Sector,Industry,Revenue,Profits,Employees
0,1,Walmart,Retailing,General Merchandisers,482130,14694,2300000
1,2,Exxon Mobil,Energy,Petroleum Refining,246204,16150,75600
2,3,Apple,Technology,"Computers, Office Equipment",233715,53394,110000
3,4,Berkshire Hathaway,Financials,Insurance: Property and Casualty (Stock),210821,24083,331000
4,5,McKesson,Health Care,Wholesalers: Health Care,181241,1476,70400
...,...,...,...,...,...,...,...
995,996,New York Community Bancorp,Financials,Commercial Banks,1902,-47,3448
996,997,Portland General Electric,Energy,Utilities: Gas and Electric,1898,172,2646
997,997,Portland General Electric,Energy,Utilities: Gas and Electric,1898,172,2646
998,999,Wendy’s,"Hotels, Resturants & Leisure",Food Services,1896,161,21200
999,1000,Briggs & Stratton,Industrials,Industrial Machinery,1895,46,5480

In [41]:
dt.describe()

             Rank        Revenue       Profits     Employees
count  1000.00000    1000.000000   1000.000000  1.000000e+03
mean    500.49600   13535.525000    894.093000  3.302800e+04
std     288.81727   28820.519135   3297.063594  9.042769e+04
min       1.00000    1895.000000 -23119.000000  5.200000e+01
25%     250.75000    2898.250000     82.750000  6.405250e+03
50%     500.50000    5113.000000    282.500000  1.251950e+04
75%     750.25000   11386.000000    784.500000  2.812500e+04
max    1000.00000  482130.000000  53394.000000  2.300000e+06

In [42]:
fortune.describe()

             Rank        Revenue       Profits     Employees
count  1000.00000    1000.000000   1000.000000  1.000000e+03
mean    500.49600   13535.525000    894.093000  3.302800e+04
std     288.81727   28820.519135   3297.063594  9.042769e+04
min       1.00000    1895.000000 -23119.000000  5.200000e+01
25%     250.75000    2898.250000     82.750000  6.405250e+03
50%     500.50000    5113.000000    282.500000  1.251950e+04
75%     750.25000   11386.000000    784.500000  2.812500e+04
max    1000.00000  482130.000000  53394.000000  2.300000e+06

In [43]:
dt=pd.DataFrame({"Name":["A","B","C","D"],"Team":["X","Y","Z","Y"],"Salary":[4000,50000,30000,4500],"Profits":[59,78,93,76]})

In [44]:
dt

  Name Team  Salary  Profits
0    A    X    4000       59
1    B    Y   50000       78
2    C    Z   30000       93
3    D    Y    4500       76

In [45]:
dt.groupby("Team")

In [46]:
group=dt.groupby("Team")
group

In [48]:
result=group.agg({"Salary":"mean","Profits":"sum"})
result

       Salary  Profits
Team
X      4000.0       59
Y     27250.0      154
Z     30000.0       93

In [49]:
df=pd.DataFrame({"Name":["X","Y","Z","P"],"Score1":[89,67,88,87],"Score2":[92,97,67,79]})
df

  Name  Score1  Score2
0    X      89      92
1    Y      67      97
2    Z      88      67
3    P      87      79

In [50]:
df=df.set_index("Name")

In [51]:
df

      Score1  Score2
Name
X         89      92
Y         67      97
Z         88      67
P         87      79

In [53]:
new=df[(df["Score1"]>80)& (df["Score2"]>90)]

In [54]:
new

      Score1  Score2
Name
X         89      92

In [55]:
df["Avg_score"]=(df["Score1"]+df["Score2"]/2)
df

      Score1  Score2  Avg_score
Name
X         89      92      135.0
Y         67      97      115.5
Z         88      67      121.5
P         87      79      126.5

In [61]:
df=df.reset_index()
df

  Name  Score1  Score2  Avg_score
0    X      89      92      135.0
1    Y      67      97      115.5
2    Z      88      67      121.5
3    P      87      79      126.5

In [62]:
df[["Name","Avg_score"]]

  Name  Avg_score
0    X      135.0
1    Y      115.5
2    Z      121.5
3    P      126.5

In [63]:
df=df.set_index(["Name","Avg_score"])
df

                Score1  Score2
Name Avg_score
X    135.0          89      92
Y    115.5          67      97
Z    121.5          88      67
P    126.5          87      79

In [64]:
df=df.reset_index()
df

  Name  Avg_score  Score1  Score2
0    X      135.0      89      92
1    Y      115.5      67      97
2    Z      121.5      88      67
3    P      126.5      87      79

In [65]:
data={"Name":["A","B","C","D"],"Team":["X","X","Y","Y"],"Salary":[50000,55000,52000,53000],"Profit":["45","30","60","25"]}

In [66]:
data

{'Name': ['A', 'B', 'C', 'D'],
 'Team': ['X', 'X', 'Y', 'Y'],
 'Salary': [50000, 55000, 52000, 53000],
 'Profit': ['45', '30', '60', '25']}

In [68]:
dt=pd.DataFrame(data)

In [69]:
dt

  Name Team  Salary Profit
0    A    X   50000     45
1    B    X   55000     30
2    C    Y   52000     60
3    D    Y   53000     25

In [70]:
dt.describe()

             Salary
count      4.000000
mean   52500.000000
std     2081.665999
min    50000.000000
25%    51500.000000
50%    52500.000000
75%    53500.000000
max    55000.000000

In [71]:
group=dt.groupby("Team")

In [72]:
group

In [73]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Team    4 non-null      object
 2   Salary  4 non-null      int64
 3   Profit  4 non-null      object
dtypes: int64(1), object(3)
memory usage: 260.0+ bytes

In [74]:
type("Salary")

str

In [76]:
nba.loc[:,["Name","Position","Team"]]

                  Name Position                Team
0           Saddiq Bey        F       Atlanta Hawks
1    Bogdan Bogdanovic        G       Atlanta Hawks
2          Kobe Bufkin        G       Atlanta Hawks
3         Clint Capela        C       Atlanta Hawks
4       Bruno Fernando      F-C       Atlanta Hawks
..                 ...      ...                 ...
587       Ryan Rollins        G  Washington Wizards
588      Landry Shamet        G  Washington Wizards
589   Tristan Vukcevic        F  Washington Wizards
590       Delon Wright        G  Washington Wizards
591                NaN      NaN                 NaN

[592 rows x 3 columns]

In [78]:
nba.loc[nba["Position"]=="C",["Name","Team","Position"]].head()

                 Name               Team Position
3        Clint Capela      Atlanta Hawks        C
26  Mfiondu Kabengele     Boston Celtics        C
39        Nic Claxton      Brooklyn Nets        C
45     Day'Ron Sharpe      Brooklyn Nets        C
67      Nick Richards  Charlotte Hornets        C

In [79]:
nba.iloc[:10,3]

0     6-7
1     6-5
2     6-5
3    6-10
4    6-10
5     6-4
6     6-6
7    6-11
8     6-8
9     6-8
Name: Height, dtype: object

In [81]:
nba[(nba["Salary"]>4000000) & (nba["Salary"]<5000000)]

,Name,Team,Position,Height,Weight,College,Salary,New_salary
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.0,4784832.15
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.0,4298956.20
30,Payton Pritchard,Boston Celtics,G,6-1,195.0,Oregon,4037277.0,4239140.85
56,James Bouknight,Charlotte Hornets,G,6-4,190.0,Connecticut,4570080.0,4798584.00
115,Josh Green,Dallas Mavericks,G,6-7,200.0,Arizona,4765339.0,5003605.95
149,Zeke Nnaji,Denver Nuggets,F-C,6-9,240.0,Arizona,4306281.0,4521595.05
162,Jalen Duren,Detroit Pistons,C,6-11,250.0,Memphis,4330680.0,4547214.00
264,Taurean Prince,Los Angeles Lakers,F,6-6,218.0,Baylor,4516000.0,4741800.00
269,Jarred Vanderbilt,Los Angeles Lakers,F,6-8,214.0,Kentucky,4698000.0,4932900.00
291,Ziaire Williams,Memphis Grizzlies,F,6-9,185.0,Stanford,4810200.0,5050710.00
337,Nickeil Alexander-Walker,Minnesota Timberwolves,G,6-5,205.0,Virginia Tech,4687500.0,4921875.00
358,Jordan Hawkins,New Orleans Pelicans,G,6-5,190.0,Connecticut,4310196.0,4525705.80
384,Immanuel Quickley,New York Knicks,G,6-2,190.0,Kentucky,4171548.0,4380125.40
394,Ousmane Dieng,Oklahoma City Thunder,F,6-9,185.0,New Zealand Breakers,4798440.0,5038362.00
411,Jalen Williams,Oklahoma City Thunder,G-F,6-5,211.0,Santa Clara,4558680.0,4786614.00
443,Tyrese Maxey,Philadelphia 76ers,G,6-2,200.0,Kentucky,4343920.0,4561116.00
491,Chris Duarte,Sacramento Kings,G,6-5,190.0,Oregon,4124400.0,4330620.00
528,Precious Achiuwa,Toronto Raptors,F,6-8,225.0,Memphis,4379526.0,4598502.30
532,Gradey Dick,Toronto Raptors,G,6-8,205.0,Kansas,4536708.0,4763543.40
539,Jalen McDaniels,Toronto Raptors,F-C,6-9,205.0,San Diego State,4516000.0,4741800.00
549,Ochai Agbaji,Utah Jazz,G,6-5,215.0,Kansas,4114200.0,4319910.00

In [82]:
df=pd.DataFrame(fortune)
df

,Rank,Company,Sector,Industry,Revenue,Profits,Employees
0,1,Walmart,Retailing,General Merchandisers,482130,14694,2300000
1,2,Exxon Mobil,Energy,Petroleum Refining,246204,16150,75600
2,3,Apple,Technology,"Computers, Office Equipment",233715,53394,110000
3,4,Berkshire Hathaway,Financials,Insurance: Property and Casualty (Stock),210821,24083,331000
4,5,McKesson,Health Care,Wholesalers: Health Care,181241,1476,70400
...,...,...,...,...,...,...,...
995,996,New York Community Bancorp,Financials,Commercial Banks,1902,-47,3448
996,997,Portland General Electric,Energy,Utilities: Gas and Electric,1898,172,2646
997,997,Portland General Electric,Energy,Utilities: Gas and Electric,1898,172,2646
998,999,Wendy’s,"Hotels, Resturants & Leisure",Food Services,1896,161,21200
999,1000,Briggs & Stratton,Industrials,Industrial Machinery,1895,46,5480

In [83]:
df.groupby("Sector")["Profits"].sum()

Sector
Aerospace & Defense              28742
Apparel                           8236
Business Services                28227
Chemicals                        22628
Energy                          -73447
Engineering & Construction        5304
Financials                      260209
Food and Drug Stores             16759
Food, Beverages & Tobacco        51417
Health Care                     106114
Hotels, Resturants & Leisure     20697
Household Products               14428
Industrials                      20764
Materials                         4428
Media                            24347
Motor Vehicles & Parts           25898
Retailing                        47830
Technology                      180473
Telecommunications               48637
Transportation                   44169
Wholesalers                       8233
Name: Profits, dtype: int64

In [84]:
df.groupby("Sector")["Profits"].mean()

Sector
Aerospace & Defense             1437.100000
Apparel                          549.066667
Business Services                553.470588
Chemicals                        754.266667
Energy                          -602.024590
Engineering & Construction       204.000000
Financials                      1872.007194
Food and Drug Stores            1117.266667
Food, Beverages & Tobacco       1195.744186
Health Care                     1414.853333
Hotels, Resturants & Leisure     827.880000
Household Products               515.285714
Industrials                      451.391304
Materials                        102.976744
Media                            973.880000
Motor Vehicles & Parts          1079.083333
Retailing                        597.875000
Technology                      1769.343137
Telecommunications              3242.466667
Transportation                  1226.916667
Wholesalers                      205.825000
Name: Profits, dtype: float64

In [85]:
sectors=fortune.groupby("Sector")
sectors

In [87]:
len("Sectors")

7

In [88]:
sectors.size()

Sector
Aerospace & Defense              20
Apparel                          15
Business Services                51
Chemicals                        30
Energy                          122
Engineering & Construction       26
Financials                      139
Food and Drug Stores             15
Food, Beverages & Tobacco        43
Health Care                      75
Hotels, Resturants & Leisure     25
Household Products               28
Industrials                      46
Materials                        43
Media                            25
Motor Vehicles & Parts           24
Retailing                        80
Technology                      102
Telecommunications               15
Transportation                   36
Wholesalers                      40
dtype: int64

In [90]:
sectors.first()

,Rank,Company,Industry,Revenue,Profits,Employees
Sector,,,,,,
Aerospace & Defense,24,Boeing,Aerospace and Defense,96114,5176,161400
Apparel,91,Nike,Apparel,30601,3273,62600
Business Services,144,ManpowerGroup,Temporary Help,19330,419,27000
Chemicals,56,Dow Chemical,Chemicals,48778,7685,49495
Energy,2,Exxon Mobil,Petroleum Refining,246204,16150,75600
Engineering & Construction,155,Fluor,"Engineering, Construction",18114,413,38758
Financials,4,Berkshire Hathaway,Insurance: Property and Casualty (Stock),210821,24083,331000
Food and Drug Stores,7,CVS Health,Food and Drug Stores,153290,5237,199000
"Food, Beverages & Tobacco",41,Archer Daniels Midland,Food Production,67702,1849,32300
Health Care,5,McKesson,Wholesalers: Health Care,181241,1476,70400
"Hotels, Resturants & Leisure",109,McDonald’s,Food Services,25413,4529,420000
Household Products,34,Procter & Gamble,Household and Personal Products,78756,7036,110000
Industrials,11,General Electric,Industrial Machinery,140389,-6126,333000
Materials,126,Alcoa,Metals,22534,-322,60000
Media,53,Disney,Entertainment,52465,8382,185000
Motor Vehicles & Parts,8,General Motors,Motor Vehicles and Parts,152356,9687,215000
Retailing,1,Walmart,General Merchandisers,482130,14694,2300000
Technology,3,Apple,"Computers, Office Equipment",233715,53394,110000
Telecommunications,10,AT&T,Telecommunications,146801,13345,281450
Transportation,48,UPS,"Mail, Package, and Freight Delivery",58363,4844,341240
Wholesalers,57,Sysco,Wholesalers: Food and Grocery,48681,687,51700

In [92]:
sectors.last()

,Rank,Company,Industry,Revenue,Profits,Employees
Sector,,,,,,
Aerospace & Defense,987,Delta Tucker Holdings,Aerospace and Defense,1923,-133,12000
Apparel,917,Guess,Apparel,2204,82,13500
Business Services,993,DeVry Education Group,Education,1910,140,11770
Chemicals,949,H.B. Fuller,Chemicals,2084,87,4425
Energy,997,Portland General Electric,Utilities: Gas and Electric,1898,172,2646
Engineering & Construction,994,MDC Holdings,Homebuilders,1909,66,1225
Financials,996,New York Community Bancorp,Commercial Banks,1902,-47,3448
Food and Drug Stores,928,Fred’s,Food and Drug Stores,2151,-7,7103
"Food, Beverages & Tobacco",954,Alliance One International,Tobacco,2066,-15,6835
Health Care,978,Providence Service,Health Care: Pharmacy and Other Services,1987,84,9072
"Hotels, Resturants & Leisure",999,Wendy’s,Food Services,1896,161,21200
Household Products,992,Revlon,Household and Personal Products,1914,56,5700
Industrials,1000,Briggs & Stratton,Industrial Machinery,1895,46,5480
Materials,986,Schnitzer Steel Industries,Metals,1924,-197,2955
Media,989,Cenveo,"Publishing, Printing",1921,-31,7300
Motor Vehicles & Parts,979,Allison Transmission Holdings,Motor Vehicles and Parts,1986,182,2700
Retailing,973,99 Cents Only Stores,Specialty Retailers: Other,1999,-232,18200
Technology,990,F5 Networks,Network and Other Communications Equipment,1920,365,4178
Telecommunications,786,Equinix,Telecommunications,2726,188,5042
Transportation,974,Roadrunner Transportation Systems,Transportation and Logistics,1995,48,4502
Wholesalers,991,BlueLinx Holdings,Wholesalers: Diversified,1917,-12,1600

In [93]:
sectors.get_group("Retailing")["Profits"].sum()

np.int64(47830)

In [94]:
sectors.get_group("Energy")["Profits"].sum()

np.int64(-73447)

In [95]:
sectors.get_group("Apparel")["Revenue"].sum()

np.int64(95968)

In [96]:
sectors.get_group("Energy")

,Rank,Company,Sector,Industry,Revenue,Profits,Employees
1,2,Exxon Mobil,Energy,Petroleum Refining,246204,16150,75600
13,14,Chevron,Energy,Petroleum Refining,131118,4587,61500
29,30,Phillips 66,Energy,Petroleum Refining,87169,4227,14000
31,32,Valero Energy,Energy,Petroleum Refining,81824,3990,10103
41,42,Marathon Petroleum,Energy,Petroleum Refining,64566,2852,45440
...,...,...,...,...,...,...,...
980,981,WPX Energy,Energy,"Mining, Crude-Oil Production",1958,-1727,1040
982,983,Adams Resources & Energy,Energy,Petroleum Refining,1944,-1,809
994,995,EP Energy,Energy,"Mining, Crude-Oil Production",1908,-3748,665
996,997,Portland General Electric,Energy,Utilities: Gas and Electric,1898,172,2646
997,997,Portland General Electric,Energy,Utilities: Gas and Electric,1898,172,2646

In [98]:
sectors.get_group("Apparel")

     Rank               Company   Sector Industry  Revenue  Profits  Employees
90     91                  Nike  Apparel  Apparel    30601     3273      62600
230   231                    VF  Apparel  Apparel    12377     1232      64000
339   340                   PVH  Apparel  Apparel     8020      572      26200
353   354          Ralph Lauren  Apparel  Apparel     7620      702      20000
447   448           Hanesbrands  Apparel  Apparel     5732      429      65300
546   547          Levi Strauss  Apparel  Apparel     4495      209      12500
574   575                 Coach  Apparel  Apparel     4192      402      12950
596   597          Under Armour  Apparel  Apparel     3963      233       9600
682   683          Fossil Group  Apparel  Apparel     3229      221      15100
694   695       Skechers U.S.A.  Apparel  Apparel     3159      232       6400
725   726              Carter’s  Apparel  Apparel     3014      238      16800
793   794  Wolverine World Wide  Apparel  Apparel     2692      123       6550
876   877   G-III Apparel Group  Apparel  Apparel     2344      114       8919
881   882   Columbia Sportswear  Apparel  Apparel     2326      174       5978
916   917                 Guess  Apparel  Apparel     2204       82      13500

In [99]:
df.groupby(["Industry","Sector"])["Revenue"].sum()

Industry                                       Sector
Advertising, marketing                         Business Services       22748
Aerospace and Defense                          Aerospace & Defense    357940
Airlines                                       Transportation         158948
Apparel                                        Apparel                 95968
Automotive Retailing, Services                 Retailing              113823
                                                                       ...
Waste Management                               Business Services       30454
Wholesalers: Diversified                       Wholesalers            176138
Wholesalers: Electronics and Office Equipment  Wholesalers            147906
Wholesalers: Food and Grocery                  Wholesalers            111774
Wholesalers: Health Care                       Health Care            444512
Name: Revenue, Length: 79, dtype: int64

In [100]:
sectors["Revenue"].sum()

Sector
Aerospace & Defense              357940
Apparel                           95968
Business Services                272195
Chemicals                        243897
Energy                          1517809
Engineering & Construction       153983
Financials                      2217159
Food and Drug Stores             483769
Food, Beverages & Tobacco        555967
Health Care                     1614707
Hotels, Resturants & Leisure     169546
Household Products               234737
Industrials                      497581
Materials                        259145
Media                            220764
Motor Vehicles & Parts           482540
Retailing                       1465076
Technology                      1377600
Telecommunications               461834
Transportation                   408508
Wholesalers                      444800
Name: Revenue, dtype: int64

In [102]:
sectors.agg({"Employees":"sum","Profits":"mean","Revenue":"sum"})

                              Employees      Profits  Revenue
Sector
Aerospace & Defense              968057  1437.100000   357940
Apparel                          346397   549.066667    95968
Business Services               1361050   553.470588   272195
Chemicals                        463651   754.266667   243897
Energy                          1188927  -602.024590  1517809
Engineering & Construction       406708   204.000000   153983
Financials                      3359948  1872.007194  2217159
Food and Drug Stores            1395398  1117.266667   483769
Food, Beverages & Tobacco       1211632  1195.744186   555967
Health Care                     2678289  1414.853333  1614707
Hotels, Resturants & Leisure    2484245   827.880000   169546
Household Products               646038   515.285714   234737
Industrials                     1545229   451.391304   497581
Materials                        638123   102.976744   259145
Media                            550314   973.880000   220764
Motor Vehicles & Parts          1082560  1079.083333   482540
Retailing                       6227629   597.875000  1465076
Technology                      3578949  1769.343137  1377600
Telecommunications               832468  3242.466667   461834
Transportation                  1536793  1226.916667   408508
Wholesalers                      525597   205.825000   444800

In [103]:
icecream=["Starwberry","Choco","Vanilla","Cookies"]
pd.Series(icecream)

0    Starwberry
1         Choco
2       Vanilla
3       Cookies
dtype: object

In [104]:
type(icecream)

list

In [111]:
ice_cream=pd.Series(icecream) # given a vaiable to the series

In [112]:
type(ice_cream)

pandas.core.series.Series

In [123]:
icecream.size

AttributeError: 'list' object has no attribute 'size'

In [121]:
ice_cream.values

array(['Starwberry', 'Choco', 'Vanilla', 'Cookies'], dtype=object)

In [124]:
ice_cream.size

4

In [115]:
cream=pd.Series(["Starwberry","Choco","Vanilla","Cookies"])

In [117]:
type(cream)

pandas.core.series.Series

In [120]:
cream.size

4

In [106]:
adjectives=pd.Series(["Smart","beautiful","pretty","lovely","kind"])
adjectives

0        Smart
1    beautiful
2       pretty
3       lovely
4         kind
dtype: object

In [107]:
type(adjectives)

pandas.core.series.Series

In [119]:
adjectives.size

5

In [125]:
adjectives.values

array(['Smart', 'beautiful', 'pretty', 'lovely', 'kind'], dtype=object)

In [126]:
adjectives.is_unique

True

In [127]:
adjectives=["Smart","beautiful","pretty","lovely","kind"]
icecream=["Starwberry","Choco","Vanilla","Cookies","butterscotch"]
pd.Series(adjectives,icecream)

Starwberry          Smart
Choco           beautiful
Vanilla            pretty
Cookies            lovely
butterscotch         kind
dtype: object

In [128]:
pd.Series(index=adjectives,data=icecream)

Smart          Starwberry
beautiful           Choco
pretty            Vanilla
lovely            Cookies
kind         butterscotch
dtype: object

In [130]:
nba.sort_index(ascending=False) # ascending false means decending

,Name,Team,Position,Height,Weight,College,Salary,New_salary
591,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.0,8604878.10
589,Tristan Vukcevic,Washington Wizards,F,6-10,220.0,Real Madrid,NaN,NaN
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.0,10762500.00
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.0,1805857.20
...,...,...,...,...,...,...,...,...
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.0,2710598.10
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.0,21646800.00
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.0,4298956.20
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.0,19635000.00
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.0,4784832.15

In [131]:
nba.sort_index(ascending =True)

,Name,Team,Position,Height,Weight,College,Salary,New_salary
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.0,4784832.15
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.0,19635000.00
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.0,4298956.20
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.0,21646800.00
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.0,2710598.10
...,...,...,...,...,...,...,...,...
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.0,1805857.20
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.0,10762500.00
589,Tristan Vukcevic,Washington Wizards,F,6-10,220.0,Real Madrid,NaN,NaN
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.0,8604878.10
591,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [133]:
num=[[1,2,3,4,5],[6,7,8,9,10],[11,12,13,14,15],[16,17,18,19,20]]

In [134]:
type(num)

list

In [135]:
num

[[1, 2, 3, 4, 5], [6, 7, 8, 9, 10], [11, 12, 13, 14, 15], [16, 17, 18, 19, 20]]

In [136]:
array=np.array(num)

In [137]:
array

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20]])

In [138]:
type(array)

numpy.ndarray

In [139]:
for n in range(0,21):
    print(n)

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20

In [140]:
np.array(range(0,21))

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20])

In [141]:
np.arange(0,21)

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20])

In [146]:
first_thirty=np.linspace(0,29,30)
print(first_thirty)

[ 0.  1.  2.  3.  4.  5.  6.  7.  8.  9. 10. 11. 12. 13. 14. 15. 16. 17.
 18. 19. 20. 21. 22. 23. 24. 25. 26. 27. 28. 29.]

In [147]:
first_thirty.shape

(30,)

In [148]:
first_thirty.reshape(3,10)

array([[ 0.,  1.,  2.,  3.,  4.,  5.,  6.,  7.,  8.,  9.],
       [10., 11., 12., 13., 14., 15., 16., 17., 18., 19.],
       [20., 21., 22., 23., 24., 25., 26., 27., 28., 29.]])

In [149]:
first_thirty.reshape(5,6)

array([[ 0.,  1.,  2.,  3.,  4.,  5.],
       [ 6.,  7.,  8.,  9., 10., 11.],
       [12., 13., 14., 15., 16., 17.],
       [18., 19., 20., 21., 22., 23.],
       [24., 25., 26., 27., 28., 29.]])

In [150]:
nba.squeeze()

,Name,Team,Position,Height,Weight,College,Salary,New_salary
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.0,4784832.15
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.0,19635000.00
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.0,4298956.20
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.0,21646800.00
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.0,2710598.10
...,...,...,...,...,...,...,...,...
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.0,1805857.20
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.0,10762500.00
589,Tristan Vukcevic,Washington Wizards,F,6-10,220.0,Real Madrid,NaN,NaN
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.0,8604878.10
591,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [153]:
nba[["feet","inch"]]=nba["Height"].str.split("-",expand=True)

In [154]:
nba

,Name,Team,Position,Height,Weight,College,Salary,New_salary,feet,inch
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.0,4784832.15,6,7
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.0,19635000.00,6,5
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.0,4298956.20,6,5
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.0,21646800.00,6,10
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.0,2710598.10,6,10
...,...,...,...,...,...,...,...,...,...,...
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.0,1805857.20,6,3
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.0,10762500.00,6,4
589,Tristan Vukcevic,Washington Wizards,F,6-10,220.0,Real Madrid,NaN,NaN,6,10
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.0,8604878.10,6,5
591,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [155]:
type("feet")

str

In [159]:
nba["feet"]=nba["feet"].astype(float)
nba

,Name,Team,Position,Height,Weight,College,Salary,New_salary,feet,inch
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.0,4784832.15,6.0,7
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.0,19635000.00,6.0,5
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.0,4298956.20,6.0,5
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.0,21646800.00,6.0,10
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.0,2710598.10,6.0,10
...,...,...,...,...,...,...,...,...,...,...
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.0,1805857.20,6.0,3
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.0,10762500.00,6.0,4
589,Tristan Vukcevic,Washington Wizards,F,6-10,220.0,Real Madrid,NaN,NaN,6.0,10
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.0,8604878.10,6.0,5
591,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [160]:
type("feet")

str

In [162]:
nba["feet"]=nba["feet"].astype(str)
nba

,Name,Team,Position,Height,Weight,College,Salary,New_salary,feet,inch
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.0,4784832.15,6.0,7
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.0,19635000.00,6.0,5
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.0,4298956.20,6.0,5
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.0,21646800.00,6.0,10
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.0,2710598.10,6.0,10
...,...,...,...,...,...,...,...,...,...,...
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.0,1805857.20,6.0,3
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.0,10762500.00,6.0,4
589,Tristan Vukcevic,Washington Wizards,F,6-10,220.0,Real Madrid,NaN,NaN,6.0,10
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.0,8604878.10,6.0,5
591,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,nan,NaN

In [163]:
nba["Height_new(in inches)"]=(nba["feet"]*12)+nba["inch"]
nba

,Name,Team,Position,Height,Weight,College,Salary,New_salary,feet,inch,Height_new(in inches)
0,Saddiq Bey,Atlanta Hawks,F,6-7,215.0,Villanova,4556983.0,4784832.15,6.0,7,6.06.06.06.06.06.06.06.06.06.06.06.07
1,Bogdan Bogdanovic,Atlanta Hawks,G,6-5,225.0,Fenerbahce,18700000.0,19635000.00,6.0,5,6.06.06.06.06.06.06.06.06.06.06.06.05
2,Kobe Bufkin,Atlanta Hawks,G,6-5,195.0,Michigan,4094244.0,4298956.20,6.0,5,6.06.06.06.06.06.06.06.06.06.06.06.05
3,Clint Capela,Atlanta Hawks,C,6-10,256.0,Elan Chalon,20616000.0,21646800.00,6.0,10,6.06.06.06.06.06.06.06.06.06.06.06.010
4,Bruno Fernando,Atlanta Hawks,F-C,6-10,240.0,Maryland,2581522.0,2710598.10,6.0,10,6.06.06.06.06.06.06.06.06.06.06.06.010
...,...,...,...,...,...,...,...,...,...,...,...
587,Ryan Rollins,Washington Wizards,G,6-3,180.0,Toledo,1719864.0,1805857.20,6.0,3,6.06.06.06.06.06.06.06.06.06.06.06.03
588,Landry Shamet,Washington Wizards,G,6-4,190.0,Wichita State,10250000.0,10762500.00,6.0,4,6.06.06.06.06.06.06.06.06.06.06.06.04
589,Tristan Vukcevic,Washington Wizards,F,6-10,220.0,Real Madrid,NaN,NaN,6.0,10,6.06.06.06.06.06.06.06.06.06.06.06.010
590,Delon Wright,Washington Wizards,G,6-5,185.0,Utah,8195122.0,8604878.10,6.0,5,6.06.06.06.06.06.06.06.06.06.06.06.05
591,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,nan,NaN,NaN

In [164]:
nba.loc[4:8,["Name","Team","Salary"]]

              Name           Team      Salary
4   Bruno Fernando  Atlanta Hawks   2581522.0
5    Trent Forrest  Atlanta Hawks    508891.0
6       AJ Griffin  Atlanta Hawks   3712920.0
7   Mouhamed Gueye  Atlanta Hawks   1119563.0
8  De'Andre Hunter  Atlanta Hawks  20089286.0